newOrgModeExporter/upgradingToTheNewOrgModeExporter.org
* Title, Author, etc.						   :noexport:
#+TITLE:     Upgrading to the new Emacs org-mode exporter
#+AUTHOR:    George Jones <gmj AT pobox DOT com>, and "eludom" most other places.
#+EMAIL:     gmj@so
#+DATE:      2013-05-10 Fri
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+OPTIONS:   TOC:nil

* What this is
  This documents my process of upgrading to the new org-mode exporter.
  http://orgmode.org/worg/exporters/ox-overview.html

* Setup
** Some preliminary setup to make execution of these examples work
   Add this stuff to your ~/.emacs.d/init.el or otherwise eval it.

   See http://orgmode.org/worg/org-contrib/babel/intro.html.
     
     #+BEGIN_SRC emacs-lisp :exports code
     (org-babel-do-load-languages
         'org-babel-load-languages '((sh . t) (lisp . t) ))
     (setq org-export-babel-evaluate nil)
     (setq org-confirm-babel-evaluate nil)
     (setq org-babel-sh-command "bash")
     #+END_SRC

     #+RESULTS:
     : bash

** Emacs Version
   #+BEGIN_SRC elisp :exports both
   (emacs-version)
   #+END_SRC

   #+RESULTS:
   : GNU Emacs 24.3.50.1 (x86_64-pc-linux-gnu, GTK+ Version 3.4.2)
   :  of 2013-04-21 on wani09, modified by Debian

** Initial Org Version
   #+BEGIN_SRC elisp :exports both
   (org-version)
   #+END_SRC

   #+RESULTS:
   : 7.9.3f

* Installation
   - See http://orgmode.org/manual/Installation.html
** DONE Initial pull of latest org-mode
   #+BEGIN_SRC sh :exports code :results output
   set -x -u
   date
   cd ~
   mkdir -p ~/src
   cd ~/src
   set +x # errors OK
   git clone git://orgmode.org/org-mode.git 2>&1
   set -x
   ls -r -d -1 $PWD/{*,.*}
   #+END_SRC

   #+RESULTS:
   : Sat May 11 10:09:35 UTC 2013
   : fatal: destination path 'org-mode' already exists and is not an empty directory.
   : /home/gmj/src/org-mode
   : /home/gmj/src/..
   : /home/gmj/src/.

** DONE Pull latest updates to org-mode
   #+BEGIN_SRC sh :exports code :results output
   set -x -u
   date
   cd ~/src/org-mode
   set +x # errors OK   
   git pull 2>&1
   set -x
   ls -r -d -1 $PWD/{*,.*}
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Sat May 11 10:09:24 UTC 2013
   Already up-to-date.
   /home/gmj/src/org-mode/testing
   /home/gmj/src/org-mode/request-assign-future.txt
   /home/gmj/src/org-mode/README_maintainer
   /home/gmj/src/org-mode/README_git
   /home/gmj/src/org-mode/README_ELPA
   /home/gmj/src/org-mode/README_contribute
   /home/gmj/src/org-mode/README
   /home/gmj/src/org-mode/mk
   /home/gmj/src/org-mode/Makefile
   /home/gmj/src/org-mode/lisp
   /home/gmj/src/org-mode/.gitmodules
   /home/gmj/src/org-mode/.gitignore
   /home/gmj/src/org-mode/.git
   /home/gmj/src/org-mode/etc
   /home/gmj/src/org-mode/doc
   /home/gmj/src/org-mode/.dir-settings.el
   /home/gmj/src/org-mode/.dir-locals.el
   /home/gmj/src/org-mode/COPYING
   /home/gmj/src/org-mode/contrib
   /home/gmj/src/org-mode/..
   /home/gmj/src/org-mode/.
#+end_example

