newOrgModeExporter/upgradingToTheNewOrgModeExporter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Upgrading to the new Emacs org-mode exporter</title>
<!-- 2013-05-11 Sat 18:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

</head>
<body>
<div id="content">
<h1 class="title">Upgrading to the new Emacs org-mode exporter</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What this is</h2>
<div class="outline-text-2" id="text-1">
<p>
This documents my process of upgrading to the new org-mode exporter.
<a href="http://orgmode.org/worg/exporters/ox-overview.html">http://orgmode.org/worg/exporters/ox-overview.html</a>
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Setup</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Some preliminary setup to make execution of these examples work</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Add this stuff to your ~/.emacs.d/init.el or otherwise eval it.
</p>

<p>
See <a href="http://orgmode.org/worg/org-contrib/babel/intro.html">http://orgmode.org/worg/org-contrib/babel/intro.html</a>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-babel-do-load-languages
    'org-babel-load-languages '((sh . t) (lisp . t) ))
(setq org-export-babel-evaluate nil)
(setq org-confirm-babel-evaluate nil)
(setq org-babel-sh-command <span style="color: #8b2252;">"bash"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Emacs Version</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-elisp">(emacs-version)
</pre>
</div>

<pre class="example">
GNU Emacs 24.3.50.1 (x86_64-pc-linux-gnu, GTK+ Version 3.4.2)
 of 2013-04-21 on wani09, modified by Debian
</pre>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Initial Org Version</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-elisp">(org-version)
</pre>
</div>

<pre class="example">
7.9.3f
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Installation</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>See <a href="http://orgmode.org/manual/Installation.html">http://orgmode.org/manual/Installation.html</a>
</li>
</ul>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <span class="done DONE">DONE</span> Initial pull of latest org-mode</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #483d8b;">set</span> -x -u
date
<span style="color: #483d8b;">cd</span> ~
mkdir -p ~/src
<span style="color: #483d8b;">cd</span> ~/src
<span style="color: #483d8b;">set</span> +x <span style="color: #b22222;"># </span><span style="color: #b22222;">errors OK</span>
git clone git://orgmode.org/org-mode.git 2&gt;&amp;1
<span style="color: #483d8b;">set</span> -x
ls -r -d -1 $<span style="color: #a0522d;">PWD</span>/{*,.*}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="done DONE">DONE</span> Pull latest updates to org-mode</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #483d8b;">set</span> -x -u
date
<span style="color: #483d8b;">cd</span> ~/src/org-mode
<span style="color: #483d8b;">set</span> +x <span style="color: #b22222;"># </span><span style="color: #b22222;">errors OK   </span>
git pull 2&gt;&amp;1
<span style="color: #483d8b;">set</span> -x
ls -r -d -1 $<span style="color: #a0522d;">PWD</span>/{*,.*}
</pre>
</div>
</div>
</div>
