newOrgModeExporter/upgradingToTheNewOrgModeExporter.org
** DONE Make Autoloads
   #+BEGIN_SRC sh :exports code :results output
   set -x -u
   date
   cd ~/src/org-mode
   make autoloads 2>&1
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Sat May 11 14:04:01 UTC 2013
   make -C lisp autoloads
   make[1]: Entering directory `/home/gmj/src/org-mode/lisp'
   rm -f org-version.el org-loaddefs.el org-version.elc org-loaddefs.elc org-install.elc
   org-version: 8.0.2 (release_8.0.2-105-g4e0fad)
   Loading /home/gmj/src/org-mode/lisp/org-compat.el (source)...
   Loading /home/gmj/src/org-mode/mk/org-fixup.el (source)...
   Saving file /home/gmj/src/org-mode/lisp/org-version.el...
   Wrote /home/gmj/src/org-mode/lisp/org-version.el
   org-loaddefs: 8.0.2 (release_8.0.2-105-g4e0fad)
   Loading /home/gmj/src/org-mode/lisp/org-compat.el (source)...
   Loading /home/gmj/src/org-mode/mk/org-fixup.el (source)...
   Generating autoloads for ob-C.el...
   Generating autoloads for ob-C.el...done
   Generating autoloads for ob-R.el...
   Generating autoloads for ob-R.el...done
   Generating autoloads for ob-asymptote.el...
   Generating autoloads for ob-asymptote.el...done
   Generating autoloads for ob-awk.el...
   Generating autoloads for ob-awk.el...done
   Generating autoloads for ob-calc.el...
   Generating autoloads for ob-calc.el...done
   Generating autoloads for ob-clojure.el...
   Generating autoloads for ob-clojure.el...done
   Generating autoloads for ob-comint.el...
   Generating autoloads for ob-comint.el...done
   Generating autoloads for ob-core.el...
   Generating autoloads for ob-core.el...done
   Generating autoloads for ob-css.el...
   Generating autoloads for ob-css.el...done
   Generating autoloads for ob-ditaa.el...
   Generating autoloads for ob-ditaa.el...done
   Generating autoloads for ob-dot.el...
   Generating autoloads for ob-dot.el...done
   Generating autoloads for ob-emacs-lisp.el...
   Generating autoloads for ob-emacs-lisp.el...done
   Generating autoloads for ob-eval.el...
   Generating autoloads for ob-eval.el...done
   Generating autoloads for ob-exp.el...
   Generating autoloads for ob-exp.el...done
   Generating autoloads for ob-fortran.el...
   Generating autoloads for ob-fortran.el...done
   Generating autoloads for ob-gnuplot.el...
   Generating autoloads for ob-gnuplot.el...done
   Generating autoloads for ob-haskell.el...
   Generating autoloads for ob-haskell.el...done
   Generating autoloads for ob-io.el...
   Generating autoloads for ob-io.el...done
   Generating autoloads for ob-java.el...
   Generating autoloads for ob-java.el...done
   Generating autoloads for ob-js.el...
   Generating autoloads for ob-js.el...done
   Generating autoloads for ob-keys.el...
   Generating autoloads for ob-keys.el...done
   Generating autoloads for ob-latex.el...
   Generating autoloads for ob-latex.el...done
   Generating autoloads for ob-ledger.el...
   Generating autoloads for ob-ledger.el...done
   Generating autoloads for ob-lilypond.el...
   Generating autoloads for ob-lilypond.el...done
   Generating autoloads for ob-lisp.el...
   Generating autoloads for ob-lisp.el...done
   Generating autoloads for ob-lob.el...
   Generating autoloads for ob-lob.el...done
   Generating autoloads for ob-makefile.el...
   Generating autoloads for ob-makefile.el...done
   Generating autoloads for ob-matlab.el...
   Generating autoloads for ob-matlab.el...done
   Generating autoloads for ob-maxima.el...
   Generating autoloads for ob-maxima.el...done
   Generating autoloads for ob-mscgen.el...
   Generating autoloads for ob-mscgen.el...done
   Generating autoloads for ob-ocaml.el...
   Generating autoloads for ob-ocaml.el...done
   Generating autoloads for ob-octave.el...
   Generating autoloads for ob-octave.el...done
   Generating autoloads for ob-org.el...
   Generating autoloads for ob-org.el...done
   Generating autoloads for ob-perl.el...
   Generating autoloads for ob-perl.el...done
   Generating autoloads for ob-picolisp.el...
   Generating autoloads for ob-picolisp.el...done
   Generating autoloads for ob-plantuml.el...
   Generating autoloads for ob-plantuml.el...done
   Generating autoloads for ob-python.el...
   Generating autoloads for ob-python.el...done
   Generating autoloads for ob-ref.el...
   Generating autoloads for ob-ref.el...done
   Generating autoloads for ob-ruby.el...
   Generating autoloads for ob-ruby.el...done
   Generating autoloads for ob-sass.el...
   Generating autoloads for ob-sass.el...done
   Generating autoloads for ob-scala.el...
   Generating autoloads for ob-scala.el...done
   Generating autoloads for ob-scheme.el...
   Generating autoloads for ob-scheme.el...done
   Generating autoloads for ob-screen.el...
   Generating autoloads for ob-screen.el...done
   Generating autoloads for ob-sh.el...
   Generating autoloads for ob-sh.el...done
   Generating autoloads for ob-shen.el...
   Generating autoloads for ob-shen.el...done
   Generating autoloads for ob-sql.el...
   Generating autoloads for ob-sql.el...done
   Generating autoloads for ob-sqlite.el...
   Generating autoloads for ob-sqlite.el...done
   Generating autoloads for ob-table.el...
   Generating autoloads for ob-table.el...done
   Generating autoloads for ob-tangle.el...
   Generating autoloads for ob-tangle.el...done
   Generating autoloads for ob.el...
   Generating autoloads for ob.el...done
   Generating autoloads for org-agenda.el...
   Generating autoloads for org-agenda.el...done
   Generating autoloads for org-archive.el...
   Generating autoloads for org-archive.el...done
   Generating autoloads for org-attach.el...
   Generating autoloads for org-attach.el...done
   Generating autoloads for org-bbdb.el...
   Generating autoloads for org-bbdb.el...done
   Generating autoloads for org-bibtex.el...
   Generating autoloads for org-bibtex.el...done
   Generating autoloads for org-capture.el...
   Generating autoloads for org-capture.el...done
   Generating autoloads for org-clock.el...
   Generating autoloads for org-clock.el...done
   Generating autoloads for org-colview.el...
   Generating autoloads for org-colview.el...done
   Generating autoloads for org-compat.el...
   Generating autoloads for org-compat.el...done
   Generating autoloads for org-crypt.el...
   Generating autoloads for org-crypt.el...done
   Generating autoloads for org-ctags.el...
   Generating autoloads for org-ctags.el...done
   Generating autoloads for org-datetree.el...
   Generating autoloads for org-datetree.el...done
   Generating autoloads for org-docview.el...
   Generating autoloads for org-docview.el...done
   Generating autoloads for org-element.el...
   Generating autoloads for org-element.el...done
   Generating autoloads for org-entities.el...
   Generating autoloads for org-entities.el...done
   Generating autoloads for org-eshell.el...
   Generating autoloads for org-eshell.el...done
   Generating autoloads for org-faces.el...
   Generating autoloads for org-faces.el...done
   Generating autoloads for org-feed.el...
   Generating autoloads for org-feed.el...done
   Generating autoloads for org-footnote.el...
   Generating autoloads for org-footnote.el...done
   Generating autoloads for org-gnus.el...
   Generating autoloads for org-gnus.el...done
   Generating autoloads for org-habit.el...
   Generating autoloads for org-habit.el...done
   Generating autoloads for org-id.el...
   Generating autoloads for org-id.el...done
   Generating autoloads for org-indent.el...
   Generating autoloads for org-indent.el...done
   Generating autoloads for org-info.el...
   Generating autoloads for org-info.el...done
   Generating autoloads for org-inlinetask.el...
   Generating autoloads for org-inlinetask.el...done
   Generating autoloads for org-install.el...
   Generating autoloads for org-install.el...done
   Generating autoloads for org-irc.el...
   Generating autoloads for org-irc.el...done
   Generating autoloads for org-list.el...
   Generating autoloads for org-list.el...done
   Generating autoloads for org-macro.el...
   Generating autoloads for org-macro.el...done
   Generating autoloads for org-macs.el...
   Generating autoloads for org-macs.el...done
   Generating autoloads for org-mhe.el...
   Generating autoloads for org-mhe.el...done
   Generating autoloads for org-mobile.el...
   Generating autoloads for org-mobile.el...done
   Generating autoloads for org-mouse.el...
   Generating autoloads for org-mouse.el...done
   Generating autoloads for org-pcomplete.el...
   Generating autoloads for org-pcomplete.el...done
   Generating autoloads for org-plot.el...
   Generating autoloads for org-plot.el...done
   Generating autoloads for org-protocol.el...
   Generating autoloads for org-protocol.el...done
   Generating autoloads for org-rmail.el...
   Generating autoloads for org-rmail.el...done
   Generating autoloads for org-src.el...
   Generating autoloads for org-src.el...done
   Generating autoloads for org-table.el...
   Generating autoloads for org-table.el...done
   Generating autoloads for org-timer.el...
   Generating autoloads for org-timer.el...done
   Generating autoloads for org-version.el...
   Generating autoloads for org-version.el...done
   Generating autoloads for org-w3m.el...
   Generating autoloads for org-w3m.el...done
   Generating autoloads for org.el...
   Generating autoloads for org.el...done
   Generating autoloads for ox-ascii.el...
   Generating autoloads for ox-ascii.el...done
   Generating autoloads for ox-beamer.el...
   Generating autoloads for ox-beamer.el...done
   Generating autoloads for ox-bibtex.el...
   Generating autoloads for ox-bibtex.el...done
   Generating autoloads for ox-html.el...
   Generating autoloads for ox-html.el...done
   Generating autoloads for ox-icalendar.el...
   Generating autoloads for ox-icalendar.el...done
   Generating autoloads for ox-latex.el...
   Generating autoloads for ox-latex.el...done
   Generating autoloads for ox-man.el...
   Generating autoloads for ox-man.el...done
   Generating autoloads for ox-md.el...
   Generating autoloads for ox-md.el...done
   Generating autoloads for ox-odt.el...
   Generating autoloads for ox-odt.el...done
   Generating autoloads for ox-org.el...
   Generating autoloads for ox-org.el...done
   Generating autoloads for ox-publish.el...
   Generating autoloads for ox-publish.el...done
   Generating autoloads for ox-texinfo.el...
   Generating autoloads for ox-texinfo.el...done
   Generating autoloads for ox.el...
   Generating autoloads for ox.el...done
   Saving file /home/gmj/src/org-mode/lisp/org-loaddefs.el...
   Wrote /home/gmj/src/org-mode/lisp/org-loaddefs.el
   make[1]: Leaving directory `/home/gmj/src/org-mode/lisp'
#+end_example

** DONE Make sure we are using the correct version
   Add this to your emacs setup (~/.emacs or ~/emacs.d/init.el)

   #+BEGIN_EXAMPLE emacs-lisp
   (add-to-list 'load-path "~/src/org-mode/lisp/")
   (add-to-list 'load-path "~/src/org-mode/contrib/lisp/" t)
   #+END_EXAMPLE
* DONE Run a few tests
** Do we have the new Org Version?
   #+BEGIN_SRC elisp :exports both
   (org-version)
   #+END_SRC

   #+RESULTS:
   : 8.0.2

** DONE Export to ASCII
     Export current buffer to ASCII and open in other window
     #+BEGIN_EXAMPLE
     CTRL-C CTRL-E t A
     #+END_EXAMPLE
** DONE Export to HTML
     Export current buffer to HTML and open in browser.
     #+BEGIN_EXAMPLE
     CTRL-C CTRL-E h o
     #+END_EXAMPLE
     
* DONE Export to pdf via LaTeX
  Now we get a little crazy.  Export to pdf via LaTeX.

