newOrgModeExporter/upgradingToTheNewOrgModeExporter.html
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="done DONE">DONE</span> Make Autoloads</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #483d8b;">set</span> -x -u
date
<span style="color: #483d8b;">cd</span> ~/src/org-mode
make autoloads 2&gt;&amp;1
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <span class="done DONE">DONE</span> Make sure we are using the correct version</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Add this to your emacs setup (~/.emacs or ~/emacs.d/init.el)
</p>

<pre class="example">
(add-to-list 'load-path "~/src/org-mode/lisp/")
(add-to-list 'load-path "~/src/org-mode/contrib/lisp/" t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <span class="done DONE">DONE</span> Run a few tests</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Do we have the new Org Version?</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-elisp">(org-version)
</pre>
</div>

<pre class="example">
8.0.2
</pre>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <span class="done DONE">DONE</span> Export to ASCII</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Export current buffer to ASCII and open in other window
</p>
<pre class="example">
CTRL-C CTRL-E t A
</pre>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> <span class="done DONE">DONE</span> Export to HTML</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Export current buffer to HTML and open in browser.
</p>
<pre class="example">
CTRL-C CTRL-E h o
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <span class="done DONE">DONE</span> Export to pdf via LaTeX</h2>
<div class="outline-text-2" id="text-5">
<p>
Now we get a little crazy.  Export to pdf via LaTeX.
</p>
</div>
