newOrgModeExporter/upgradingToTheNewOrgModeExporter.org
** DONE Install necessary packages
  First, we'll have to install some stuff.  I'm testing this on a an
  Ubuntu Linux system (12.04 Security Onion distro), so your mileage
  may vary if your on some other platform (Mac, Red-Hat, etc)

  #+BEGIN_SRC sh :exports code :results output
  set -x -u
  date

  #
  # Pay no attention to the man behind the curtain.
  #
  # this goo is needed to prompt for a sudo password
  # while executing a sudo(1) command in bash under org-babel.
  echo -e "#! /bin/bash\n/usr/bin/gksudo -p -m Password" > /tmp/gksudo-stdout
  chmod +x /tmp/gksudo-stdout
  SUDO_ASKPASS="/tmp/gksudo-stdout" sudo -A -s
  #
  # Thanks to Sylvain Rousseau: http://comments.gmane.org/gmane.emacs.orgmode/52979
  #
  # As you were.  That's over.  Now just do what you need to with sudo.
  #

  sudo id # just to make sure

  sudo apt-get -y install texlive 2>&1
  sudo apt-get -y install texlive-latex-extra 2>&1
  sudo apt-get -y install texlive-bibtex-extra 2>&1
  sudo apt-get -y install bibtex2html 2>&1
  sudo apt-get -y install texlive-plain-extra 2>&1
  sudo apt-get -y install xpdf 2>&1
  #+END_SRC

  #+RESULTS:
  #+begin_example
  Sat May 11 14:41:35 UTC 2013
  uid=0(root) gid=0(root) groups=0(root)
  Reading package lists...
  Building dependency tree...
  Reading state information...
  texlive is already the newest version.
  The following packages were automatically installed and are no longer required:
    gir1.2-timezonemap-1.0 gir1.2-gstreamer-0.10 libtimezonemap1
    linux-headers-3.2.0-35 gir1.2-json-1.0 linux-headers-3.2.0-35-generic
    libjson-glib-1.0-0 gir1.2-xkl-1.0
  Use 'apt-get autoremove' to remove them.
  0 upgraded, 0 newly installed, 0 to remove and 0 not upgraded.
  Reading package lists...
  Building dependency tree...
  Reading state information...
  texlive-latex-extra is already the newest version.
  The following packages were automatically installed and are no longer required:
    gir1.2-timezonemap-1.0 gir1.2-gstreamer-0.10 libtimezonemap1
    linux-headers-3.2.0-35 gir1.2-json-1.0 linux-headers-3.2.0-35-generic
    libjson-glib-1.0-0 gir1.2-xkl-1.0
  Use 'apt-get autoremove' to remove them.
  0 upgraded, 0 newly installed, 0 to remove and 0 not upgraded.
  Reading package lists...
  Building dependency tree...
  Reading state information...
  texlive-bibtex-extra is already the newest version.
  The following packages were automatically installed and are no longer required:
    gir1.2-timezonemap-1.0 gir1.2-gstreamer-0.10 libtimezonemap1
    linux-headers-3.2.0-35 gir1.2-json-1.0 linux-headers-3.2.0-35-generic
    libjson-glib-1.0-0 gir1.2-xkl-1.0
  Use 'apt-get autoremove' to remove them.
  0 upgraded, 0 newly installed, 0 to remove and 0 not upgraded.
  Reading package lists...
  Building dependency tree...
  Reading state information...
  bibtex2html is already the newest version.
  The following packages were automatically installed and are no longer required:
    gir1.2-timezonemap-1.0 gir1.2-gstreamer-0.10 libtimezonemap1
    linux-headers-3.2.0-35 gir1.2-json-1.0 linux-headers-3.2.0-35-generic
    libjson-glib-1.0-0 gir1.2-xkl-1.0
  Use 'apt-get autoremove' to remove them.
  0 upgraded, 0 newly installed, 0 to remove and 0 not upgraded.
  Reading package lists...
  Building dependency tree...
  Reading state information...
  texlive-plain-extra is already the newest version.
  The following packages were automatically installed and are no longer required:
    gir1.2-timezonemap-1.0 gir1.2-gstreamer-0.10 libtimezonemap1
    linux-headers-3.2.0-35 gir1.2-json-1.0 linux-headers-3.2.0-35-generic
    libjson-glib-1.0-0 gir1.2-xkl-1.0
  Use 'apt-get autoremove' to remove them.
  0 upgraded, 0 newly installed, 0 to remove and 0 not upgraded.
  Reading package lists...
  Building dependency tree...
  Reading state information...
  The following packages were automatically installed and are no longer required:
    gir1.2-timezonemap-1.0 gir1.2-gstreamer-0.10 libtimezonemap1
    linux-headers-3.2.0-35 gir1.2-json-1.0 linux-headers-3.2.0-35-generic
    libjson-glib-1.0-0 gir1.2-xkl-1.0
  Use 'apt-get autoremove' to remove them.
  The following extra packages will be installed:
    gsfonts-x11 lesstif2
  The following NEW packages will be installed:
    gsfonts-x11 lesstif2 xpdf
  0 upgraded, 3 newly installed, 0 to remove and 0 not upgraded.
  Need to get 842 kB of archives.
  After this operation, 2,392 kB of additional disk space will be used.
  Get:1 http://us.archive.ubuntu.com/ubuntu/ precise/main gsfonts-x11 all 0.22 [9,108 B]
  Get:2 http://us.archive.ubuntu.com/ubuntu/ precise/universe lesstif2 amd64 1:0.95.2-1 [700 kB]
  Get:3 http://us.archive.ubuntu.com/ubuntu/ precise/universe xpdf amd64 3.02-21build1 [133 kB]
  Fetched 842 kB in 0s (1,028 kB/s)
  Selecting previously unselected package gsfonts-x11.
  (Reading database ... 296305 files and directories currently installed.)
  Unpacking gsfonts-x11 (from .../gsfonts-x11_0.22_all.deb) ...
  Selecting previously unselected package lesstif2.
  Unpacking lesstif2 (from .../lesstif2_1%3a0.95.2-1_amd64.deb) ...
  Selecting previously unselected package xpdf.
  Unpacking xpdf (from .../xpdf_3.02-21build1_amd64.deb) ...
  Processing triggers for fontconfig ...
  Processing triggers for man-db ...
  Processing triggers for desktop-file-utils ...
  Setting up gsfonts-x11 (0.22) ...
  Setting up lesstif2 (1:0.95.2-1) ...
  Setting up xpdf (3.02-21build1) ...
  Processing triggers for libc-bin ...
  ldconfig deferred processing now taking place
#+end_example
  
* DONE Export this document to pdf
** DONE Export to PDF
     Export current buffer to PDF and open
     #+BEGIN_EXAMPLE
     CTRL-C CTRL-E l o
     #+END_EXAMPLE
** If at first you don't succeed
   Check the =*Messages*= buffer for errors.  You might have to run
   pdflatex on the resulting tex file by hand to diagnose errors.
   Most likely problems are missing fonts or styles requiring more packages.
** open the pdf file
   #+BEGIN_EXAMPLE
   CTRL-C CTRL-E l o
   #+END_EXAMPLE
   should have opened the pdf file, but maybe I have
   something configured wrong, so we open in emacs directly with 
   #+BEGIN_EXAMPLE
   CTRL-X CTRL-F
   #+END_EXAMPLE
# * Add citations to LaTeX version
#  If you're wondering about all this embedded code stuff, see \cite{schulte2012multi}
# * Add citations to HTML version
* Open Issues
** Things not quite working in the new exporter  
*** TODO Get citations and bibliography working in HTML and LaTeX
   - Old exporter had org-exp-bibtex in contrib
   - New exporter will have ox-bibtex.el
     + port by Nicolas Goaziou 
     + I've done some testing.  LaTeX works.  HTML has a few issues.
** Thing I might not understand in the new exporter
*** TODO Understand what happened to #+TEXT in the new exporter?
   How do you specify text that is to be before the first section?
*** TODO Understand the template categories for export ?
   I want to insert a default set of headers, I typed
   #+BEGIN_EXAMPLE
   CTRL-C CTRL-E #
   #+END_EXAMPLE
   and it asks me for a "Options Category?"  What's that?  "?" does not list options.
*** TODO Understand why PDF file links not opening the file
* Feedback
** Send me suggestions
   If you send me suggestions, I may incorporate them in future versions.   
** Hack the source directly on github
   Alternately, you can hack the .org source directly.  The source to
   this document is available on github under https://github.com/eludom/HOWTO
# * Bibliography
# #+BIBLIOGRAPHY: refs alpha option:-d limit:t


