newOrgModeExporter/upgradingToTheNewOrgModeExporter.html

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> <span class="done DONE">DONE</span> Install necessary packages</h3>
<div class="outline-text-3" id="text-5-1">
<p>
First, we'll have to install some stuff.  I'm testing this on a an
Ubuntu Linux system (12.04 Security Onion distro), so your mileage
may vary if your on some other platform (Mac, Red-Hat, etc)
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #483d8b;">set</span> -x -u
date

<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Pay no attention to the man behind the curtain.</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">this goo is needed to prompt for a sudo password</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">while executing a sudo(1) command in bash under org-babel.</span>
<span style="color: #483d8b;">echo</span> -e <span style="color: #8b2252;">"#! /bin/bash\n/usr/bin/gksudo -p -m Password"</span> &gt; /tmp/gksudo-stdout
chmod +x /tmp/gksudo-stdout
<span style="color: #a0522d;">SUDO_ASKPASS</span>=<span style="color: #8b2252;">"/tmp/gksudo-stdout"</span> sudo -A -s
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Thanks to Sylvain Rousseau: http://comments.gmane.org/gmane.emacs.orgmode/52979</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">As you were.  That's over.  Now just do what you need to with sudo.</span>
<span style="color: #b22222;">#</span>

sudo id <span style="color: #b22222;"># </span><span style="color: #b22222;">just to make sure</span>

sudo apt-get -y install texlive 2&gt;&amp;1
sudo apt-get -y install texlive-latex-extra 2&gt;&amp;1
sudo apt-get -y install texlive-bibtex-extra 2&gt;&amp;1
sudo apt-get -y install bibtex2html 2&gt;&amp;1
sudo apt-get -y install texlive-plain-extra 2&gt;&amp;1
sudo apt-get -y install xpdf 2&gt;&amp;1
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <span class="done DONE">DONE</span> Export this document to pdf</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> <span class="done DONE">DONE</span> Export to PDF</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Export current buffer to PDF and open
</p>
<pre class="example">
CTRL-C CTRL-E l o
</pre>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> If at first you don't succeed</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Check the <code>*Messages*</code> buffer for errors.  You might have to run
pdflatex on the resulting tex file by hand to diagnose errors.
Most likely problems are missing fonts or styles requiring more packages.
</p>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> open the pdf file</h3>
<div class="outline-text-3" id="text-6-3">
<pre class="example">
CTRL-C CTRL-E l o
</pre>
<p>
should have opened the pdf file, but maybe I have
something configured wrong, so we open in emacs directly with 
</p>
<pre class="example">
CTRL-X CTRL-F
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Open Issues</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Things not quite working in the new exporter</h3>
<div class="outline-text-3" id="text-7-1">
</div><div id="outline-container-sec-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> <span class="todo TODO">TODO</span> Get citations and bibliography working in HTML and LaTeX</h4>
<div class="outline-text-4" id="text-7-1-1">
<ul class="org-ul">
<li>Old exporter had org-exp-bibtex in contrib
</li>
<li>New exporter will have ox-bibtex.el
<ul class="org-ul">
<li>port by Nicolas Goaziou 
</li>
<li>I've done some testing.  LaTeX works.  HTML has a few issues.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Thing I might not understand in the new exporter</h3>
<div class="outline-text-3" id="text-7-2">
</div><div id="outline-container-sec-7-2-1" class="outline-4">
<h4 id="sec-7-2-1"><span class="section-number-4">7.2.1</span> <span class="todo TODO">TODO</span> Understand what happened to #+TEXT in the new exporter?</h4>
<div class="outline-text-4" id="text-7-2-1">
<p>
How do you specify text that is to be before the first section?
</p>
</div>
</div>

<div id="outline-container-sec-7-2-2" class="outline-4">
<h4 id="sec-7-2-2"><span class="section-number-4">7.2.2</span> <span class="todo TODO">TODO</span> Understand the template categories for export ?</h4>
<div class="outline-text-4" id="text-7-2-2">
<p>
I want to insert a default set of headers, I typed
</p>
<pre class="example">
CTRL-C CTRL-E #
</pre>
<p>
and it asks me for a "Options Category?"  What's that?  "?" does not list options.
</p>
</div>
</div>

<div id="outline-container-sec-7-2-3" class="outline-4">
<h4 id="sec-7-2-3"><span class="section-number-4">7.2.3</span> <span class="todo TODO">TODO</span> Understand why PDF file links not opening the file</h4>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Feedback</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Send me suggestions</h3>
<div class="outline-text-3" id="text-8-1">
<p>
If you send me suggestions, I may incorporate them in future versions.   
</p>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Hack the source directly on github</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Alternately, you can hack the .org source directly.  The source to
this document is available on github under <a href="https://github.com/eludom/HOWTO">https://github.com/eludom/HOWTO</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2013-05-10 Fri</p>
<p class="author">Author: George Jones &lt;gmj AT pobox DOT com&gt;, and "eludom" most other places.</p>
<p class="date">Created: 2013-05-11 Sat 18:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.0.2)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
